SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( RF_BR_4F_44102
Type ( Engine )
WagonShape ( RF_BR_4F_44102.s )
Size  ( 2.616m 4.000m 8.780m  )
CentreOfGravity ( 0m 1.96m -0.020m )


Include ( ..\\Common_Locomotives\\LMS_4F_wagon.inc )

Comment ( ******************** Freight and Load Animations (If used) ********************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

ORTSFreightAnims (

FreightAnimStatic (
SubType( Default )
Shape ( crew_35.s )
Offset( 0, 0, 0 ) )

)

Comment ( ************************ Lights (If used) ************************
            Included in this section - Type, Colour, Location, Size, Control, etc
          *********************************************************************** )


 Lights ( 15
  Light (
   Comment( lamp front top )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
     Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffff70 )
     Position ( 0 3.135 3.782 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
    )
   )
  )
  Light (
Comment( Lamp front left )
Type ( 0 )
Conditions (
Headlight ( 3 )
                        Unit ( 2 )
)
Cycle ( 0 )
FadeIn ( 0.5 )
FadeOut ( 0.5 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( 80ffff70 )
Position ( -1.025 1.516 3.852 )
Azimuth ( 0.0 -5.0 5.0 )
Transition ( 0 )
Radius ( 0.4 )
)
)
)

Light (
   comment( Sphere of light for Exhaust )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
            State (
      Duration ( 0.0 )
      LightColour ( 80ffe610 )
      Position ( 0 10.0 -12.0 )
      Transition ( 0 )
      Radius ( 6.0 )
      Angle ( 90.0 )
                 )
            )
    )
Light (
   comment( Sphere of light for Exhaust )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
            State (
      Duration ( 0.0 )
      LightColour ( 80ffe610 )
      Position ( 0 10.0 -13.50 )
      Transition ( 0 )
      Radius ( 6.0 )
      Angle ( 90.0 )
                 )
            )
    )

Light(
comment( Flickering firebox )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle( 0 )
States(2
State(
Duration ( 0.5 )
LightColour ( eeff8800 )
Position ( 0 2.06 -3.29 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1.3 )
)
State(
Duration ( 0.3 )
LightColour ( eeff8800 )
Position ( 0 2.06 -3.29 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1.3 )

)

)
)
Light ( 
                  comment( Ashpan flashes ) 
Type ( 0 ) 
Conditions ( 
Headlight ( 3 ) 
Unit ( 0 ) 
) 
Cycle ( 0 ) 
FadeIn ( 0 ) 
FadeOut ( 0.5 ) 
States ( 28 
State ( 
Duration ( 1 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.30 ) 
LightColour ( 00000000 ) 
Position ( -0.1 01.4 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.4 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.30 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.30 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.30 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.5 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 3 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 5 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.25 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.30 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.5 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 00000000 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
) 
State ( 
Duration ( 0.6 ) 
LightColour ( 80ff7200 ) 
Position ( -0.1 0.14 -2.0 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 1 ) 
                  )
               )
          )
Light ( 
                  comment( Chimney Sparks RS1AA ) 
Type( 0 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
TimeOfDay ( 0 )
Weather ( 0 )
Coupling ( 0 )  
)
Cycle ( 0 ) 
FadeIn ( 0 ) 
FadeOut ( 0.5 ) 
States ( 28 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 4.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.42 2.8 )

Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.72 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.230 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 4.52 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 80ff7200 ) 
Position ( 0 4.72 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.92 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.230 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 4.32 2.8 )
  
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.52 2.8 )
 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.92 2.8 )
 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.226 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.35 2.8 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.55 2.8 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.25 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.8 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.230 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 80ff7200 ) 
Position ( 0 4.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 4.22 2.8 )
 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 00000000 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.225 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.5 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.233 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.23 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.23 ) 
) 
State ( 
Duration ( 0.6 ) 
LightColour ( 80ff7200 ) 
Position ( 0 9.22 2.8 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.230 ) 
                  )
               )
          )

Light ( 
                  comment( Chimney Sparks RS1AA ) 
Type( 0 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
TimeOfDay ( 0 )
Weather ( 0 )
Coupling ( 0 )  
)
Cycle ( 0 ) 
FadeIn ( 0 ) 
FadeOut ( 0.5 ) 
States ( 28 
State ( 
Duration ( 0.3 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.7 )

Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.7 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 7.22 2.7 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.7 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.234 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.7 )
  
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.7 )
 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.234 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.7 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.2235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.23 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 8.22 2.7 )
 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.7 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 00000000 ) 
Position ( 0 9.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.236 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.7 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0 5.22 2.7 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 6.22 2.72 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.236 ) 
) 
State ( 
Duration ( 0.5 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.72 )
 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.236 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.72 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 00000000 ) 
Position ( 0 6.22 2.72 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0 5.22 2.72 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.236 ) 
) 
State ( 
Duration ( 0.6 ) 
LightColour ( 80ff7200 ) 
Position ( 0 7.22 2.72 )
 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.236 ) 
                  )
               )
          )

Light ( 
                  comment( Chimney Sparks AA1 ) 
Type( 0 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
TimeOfDay ( 0 )
Weather ( 0 )
Coupling ( 0 )  
)
Cycle ( 0 ) 
FadeIn ( 0 ) 
FadeOut ( 0.5 ) 
States ( 28 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.0 2.7 )
  
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.0 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.230 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 8.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.23 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 8.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 00000000 ) 
Position ( 0.0 8.5 2.7 ) 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 3 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 8.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 8.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 )
Position ( 0.0 6.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 8.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.5 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.6 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.0 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
                  )
               )
          )

Light ( 
                  comment( Chimney Sparks AA ) 
Type( 0 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
TimeOfDay ( 0 )
Weather ( 0 )
Coupling ( 0 )  
)
Cycle ( 0 ) 
FadeIn ( 0 ) 
FadeOut ( 0.5 ) 
States ( 28 
State ( 
Duration ( 0.3 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 )
  
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.236 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.1 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.3 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( 90 90 90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 3 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 ) 
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 ) 
Azimuth ( -180 -180 -180 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 6.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 )
Position ( 0.0 5.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.25 ) 
LightColour ( 00000000 ) 
Position ( 0.0 7.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.5 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 7.5 2.7 )
Azimuth ( -90 -90 -90 ) 
Transition ( 0 ) 
Radius ( 0.23 ) 
) 
State ( 
Duration ( 0.4 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 00000000 ) 
Position ( 0.0 5.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.235 ) 
) 
State ( 
Duration ( 0.2 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 4.5 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.23 ) 
) 
State ( 
Duration ( 0.6 ) 
LightColour ( 80ff7200 ) 
Position ( 0.0 4.50 2.7 )
Azimuth ( 0 0 0 ) 
Transition ( 0 ) 
Radius ( 0.230 ) 
                  )
               )
          )

Light(
comment( Flickering Ashpan Front )
Type( 0 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
)
FadeIn( 0.975 )
FadeOut( 0.975 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.645 -1.8 )
Azimuth ( -90 -90 -90 )
Transition ( 0 )
Radius ( 1.3 )
)
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.62 -1.8 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1.3 )

)
)
)

Light(
comment( Flickering Ashpan Front )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 2 )
)
FadeIn( 0.75 )
FadeOut( 0.75 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.655 -1.8 )
Azimuth ( 45 45 45 )
Transition ( 0 )
Radius ( 1.35 )
)
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.655 -1.8 )
Azimuth ( 180 180 180 )
Transition ( 0 )
Radius ( 1.35 )

)
)
)

Light(
comment( Flickering Ashpan Front )
Type( 0 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
)
FadeIn( 1.95 )
FadeOut( 1.95 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.655 -1.8 )
Azimuth ( 180 180 180 )
Transition ( 0 )
Radius ( 1.34 )
)
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.655 -1.8 )
Azimuth ( 180 180 180 )
Transition ( 0 )
Radius ( 1.34 )

)
)
)

Light(
comment( Flickering Ashpan Front Leading )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 2 )
)
FadeIn( 1.5 )
FadeOut( 1.5 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0.0 0.652 -1.8 )
Azimuth ( 0.0 -5.0 5.0 )
Transition ( 0 )
Radius ( 1.34 )
Elevation ( -10 -10 -10 )
)
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0.0 0.652 -1.8 )
Azimuth ( 0.0 -5.0 5.0 )
Transition ( 0 )
Radius ( 1.34 )
Elevation ( -10 -10 -10 )
)
)
)

Light(
comment( Flickering Ashpan Back )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.643 -2.25 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1 )
)
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 0.643 -2.25 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1 )

)
)
)

)

Comment ( ********************* Wagon Visual Effects *********************
                      Included in this section - Effect type, etc
*********************************************************************** )


)

Engine ( RF_BR_4F_44102  

Include ( ..\\Common_Locomotives\\LMS_4F_engine.inc )

Name ( "BR 4F 44102" )

Description (
 ""

)
EngineOperatingProcedures (
"To move forward\n"+
"1.Press the W key several times to move the Reverser to full Forward.\n"+
"2.Press the ; (SEMICOLON) key to release the train brakes.\n"+
"3.Press the D key to increase the Regulator setting.\n"+  
"4.As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
"To slow the train\n"+
"1.Press the A key to move the Regulator to a lower setting.\n"+
"2.Use the brakes to further reduce speed if desired.\n\n"+
"To apply the train brakes\n"+
"1.Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
"To release the train brakes\n"+
"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
"To back up\n"+
"1.Bring your train to a full stop.\n"+ 
"2.Press the S key several times to move the Reverser to the full Reverse position.\n"+
"4.Press the ; (SEMICOLON) key to release the brakes.\n"+
"5.Slowly advance the regulator (D key).\n\n"+
"To load and unload passengers\n"+
"1. Stop at a station.\n"+
"2. Press the ENTER key.\n"+
"3. Wait for the \"permission to depart\" whistle.\n"+
"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
"To couple to a car or locomotive\n"+
"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
"TIP: To use the Coupling view, press the 6 key.\n"+
"2. Press F9 to open the Train Operations window.\n"+
"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
"4. Close the Train Operations window.\n\n"+
"To uncouple from a car or locomotive\n"+
"1. Press F9 to open the Train Operations window.\n"+
"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
"4. Close the Train Operations window.\n\n"+
"Firing commands (Automatic Fireman OFF in Options screen)\n"+
"To add coal to the firebox\n"+
"1. Press the F key to open the Firebox door.\n"+
"2. Press the R key to increase the shoveling rate.\n\n"+
"To stop adding coal to the fire\n"+
"1. Press SHIFT+R to decrease the shoveling rate.\n"+
"2. Press SHIFT+F to close the firebox door.\n\n"+
"To operate the blower\n"+
"1.Press the N key to increase the blower.\n"+
"2. Press SHIFT+N to decrease the blower.\n\n"+
"To operate the dampers\n"+
"1.Press the M key to open the dampers.\n"+
"2. Press SHIFT+M to close the dampers.\n\n"+
"To inject water into the boiler\n"+
"1.Press the I key to turn on the steam to Injector 1.\n"+
"(You can also press the O key to turn on the steam to Injector 2.)\n"+
"2.Press the K key to increase the water flow to Injector 1.\n"+
"(To increase the water flow to Injector 2, press the L key.)\n\n"+
"To stop boiler water injection\n"+ 
"1. Press the I key to turn off the steam to Injector 1.\n"+
"2. Press the O key to turn off the steam to Injector 2."
)
)